module.exports = {
  nav: {
    home: "首页",
    dsplabs: "DSP实验室",
    github: "代码库",
  },
  homeHeader: {
    title: "Distributed Storage Protocol",
    descSup: "DSP是下一代互联网的",
    descSub: "核心基础设施",
    learnMore: "了解更多",
    feature1t: "加密",
    feature1c: "端到端加密存储，确保网络存储安全",
    feature2t: "分布",
    feature2c: "跨网络的多节点分布式存储，确保网络可用性",
    feature3t: "存储",
    feature3c: "大容量和高效存储，为大文件提供分布式存储环境",
    feature4t: "共享",
    feature4c: "全网络动态分发机制，提供文件共享权限控制",
  },
  home: {
    content1: {
      title: "分布式存储协议",
      content:
        "DSP(Distributed Storage Protocol)协议，一个基于数据文件加密，分发，存储，共享等多维度的新一代互联网协议范式，DSP协议的目标是成为下一代互联网的核心基础设施。",
    },
    content2: {
      title: "架构",
    },
    content3: {
      title: "价值",
      sup1: "万物互联",
      sub1:
        "通过DSP提供的标准化网络协议接口连接，不同的联网设备通过标准化协议接口连接到同一个网络，进行数据传输、共享和存储。",
      sup2: "版权控制",
      sub2:
        "通过版权控制协议，可以根据版权归属将同一文件分发给不同的人，避免了同一文件的冗余存储。",
      sup3: "数据控制",
      sub3:
        "数据的所有权和控制权完全返回给用户。无论文件是否被删除或查看，数据所有者都需要被授权。节点和其他节点无权对文件进行操作。",
      sup4: "避免数据泄漏",
      sub4: `相同的文件将被分割。即使获得节点的所有数据，也无法获得完整的文件。基于多种加密方法的嵌套从根本上消除了数据泄漏的可能性。`,
      sup5: "防监控和防检查",
      sub5:
        "所有个人生成的数据以及上传和下载的文件数据都经过多次加密处理，甚至可以通过路由协议进行路径混淆，从而无法追踪到特定的发送者和接收者，最大限度地保证了个人隐私。",
      sup6: "数据持久性",
      sub6:
        "通过全网络多节点存储、备份节点状态监控、备份内容战略同步等多种方式保证网络内容的时效性和一致性。避免由单点故障造成的数据丢失或临时访问中断。",
      sup7: "链路智能自主优化",
      sub7:
        "自动捕获网络中节点之间的传输状态。通过分析和智能调整，动态调整节点之间的最优路径，保证网络传输状态的优化。",
      sup8: "更友好的开发对接",
      sub8:
        "接口、组件和模块是标准化的，并且是开源的，以便重用。避免重复的开发，减少冗余的开发工作，开发人员返回到业务本身。",
    },
    content4: {
      title: "DSP实验室",
      content: `由Onchain建立的DSP实验室是一个研究、开发和部署组织，旨在改进下一代互联网技术。我们希望在此基础上建立一套新的自由开放的网络协议，实现真正的数据自由和互联自由。DSP实验室希望加速建立一个分布式的、分散的和相互关联的平行世界网络创建一个更高的性能,更经济、更安全、更开放的数据共享传输协议和文件存储网络作为下一代互联网的基础提供了快速,自由和安全的交互为整个网络的信息和数据,减少了数据传输和存储成本,加快了信息自由的时代的革命。`,
    },
  },
  footer: {
    wechat: "微 信",
    email: "邮 箱",
    telegram: "电 报",
  },
};
